//!*******************************************************
//! TsDrawObject.h
//!
//! The class has a draw call.
//!
//! © 2016 Yuki Tsuneyama
#pragma once

class TsDrawObject : public TsNameObject
{
public:
    //----------------------------------------------------------
    // public method
    //
    //! これらメソッドをオーバーライドしない場合はなにもしません。
    //
    //----------------------------------------------------------

    //----------------------------------------------------------
    //! ジオメトリを作成します。
    //----------------------------------------------------------
    virtual TsBool Create( TsDevice* );

    //----------------------------------------------------------
    //! オブジェクトのDrawCallです
    //----------------------------------------------------------
    virtual TsBool Draw( TsDeviceContext* ) ;

    //----------------------------------------------------------
    //! オブジェクトのTransformを更新します
    //----------------------------------------------------------
    virtual TsBool UpdateTransform( TsDeviceContext* context );

    //----------------------------------------------------------
    //! オブジェクトのMaterialを更新します
    //----------------------------------------------------------
    virtual TsBool UpdateMaterial( TsDeviceContext* context );

    //----------------------------------------------------------
    //! オブジェクトのインデックスバッファを更新します
    //----------------------------------------------------------
    virtual TsBool UpdateIndexBuffer( TsDeviceContext* context ) ;

    //----------------------------------------------------------
    //! オブジェクトの頂点バッファを更新します
    //----------------------------------------------------------
    virtual TsBool UpdateVertexBuffer( TsDeviceContext* context );

    //----------------------------------------------------------
    //! オブジェクトのTransformを確定します。
    //----------------------------------------------------------
    virtual TsBool ApplyTransForm( TsDeviceContext * context );

    //----------------------------------------------------------
    //! オブジェクトのMaterialを確定します。
    //----------------------------------------------------------
    virtual TsBool ApplyMaterial( TsDeviceContext* context );

    //----------------------------------------------------------
    //! オブジェクトのインデックスバッファを確定します。
    //----------------------------------------------------------
    virtual TsBool ApplyIndexBuffer( TsDeviceContext* context );

    //----------------------------------------------------------
    //! オブジェクトの頂点バッファを確定します。
    //----------------------------------------------------------
    virtual TsBool ApplyVertexBuffer( TsDeviceContext* context );

    //----------------------------------------------------------
    //! オブジェクトのWorldMatrixを取得します。
    //----------------------------------------------------------
    virtual TsMatrix GetWorldMatrix();

    //----------------------------------------------------------
    //! オブジェクトのLocalMatrixを取得します。
    //----------------------------------------------------------
    virtual TsMatrix GetLocalMatrix();
};